# генератор

# генератор це спеціальний тип ітератора, 
# який дозволяє створювати послідовності значень "на льоту", 
# без необхідності зберігати всі значення в пам'яті одразу. 
# Генератори використовують ключове слово `yield` для повернення значень по одному за раз.

# різниця між return і yield:
# `return` завершує виконання функції і повертає значення,
# тоді як `yield` призупиняє виконання функції і повертає значення, 
# дозволяючи функції продовжити виконання з того ж місця при наступному виклику.

# генератор  - це функція, яка містить один або більше операторів `yield`.
# генератор створює декілька ітераторів, які можна використовувати для ітерації по послідовності значень.


def generator_event_numbers(n1, n2):
    for i in range(n1, n2): 
        if i % 2 == 0: 
             yield i #ітерація виводу парних чисел.

    for i in range(n1, n2):
        if i % 2 == 1:
            yield i #ітерація виводу непарних чисел.

for i in generator_event_numbers(1, 20):
    print(i)