# Завдання 1
# Дано числа a і b (a < b). 
# Виведіть суму всіх натуральних чисел від a до b (включно).

# a = int(input("Введіть число a (a < b): "))
# b = int(input("Введіть число b (b > a): "))
# sum = 0
# for i in range(a, b + 1):
#     sum += i
# print(f"Сума всіх натуральних чисел від {a} до {b} (включно) дорівнює {sum}.")


# Завдання 2 
# Факторіалом числа n називається число n!=1∙2∙3∙…∙n. 
# Створіть програму, яка обчислює факторіал введеного користувачем числа. 

# n = int(input("Введіть число для обчислення факторіалу: "))
# factorial = 1
# for i in range(1, n + 1):
#     factorial *= i
# print(f"Факторіал числа {n} дорівнює {factorial}.")


# Завдання 3
# Використовуючи вкладені цикли та функції print(‘*’, end=’’), print(‘ ‘, end=’’) та print() виведіть на екран прямокутний трикутник

# for i in range(8):
#     for _ in range(1 + i * 2):
#         print('*', end='')
#     print()


# Завдання 4
# Дано числа a і b (a < b). 
# Виведіть на екран суму всіх натуральних чисел від a до b (включно), які є кратними середньому арифметичному цього проміжку. 

# a = int(input("Введіть число a (a < b): "))
# b = int(input("Введіть число b (b > a): "))
# sum = 0
# for i in range(a, b + 1):
#     sum += i
# print(f"Сума всіх натуральних чисел від {a} до {b} (включно) дорівнює {sum}.")
# average = sum / (b - a + 1)
# print(f"Середнє арифметичне чисел від {a} до {b} дорівнює {average}.")
# sum_multiples = 0
# for i in range(a, b + 1):
#     if i % average == 0:
#         sum_multiples += i
# print(f"Сума всіх натуральних чисел від {a} до {b} (включно), які є кратними середньому арифметичному ({average}), дорівнює {sum_multiples}.")

# Завдання 5 
# Створіть програму, яка малює на екрані прямокутник із зірочок заданою користувачем ширини та висоти.

# width = int(input("Введіть ширину прямокутника: "))
# height = int(input("Введіть висоту прямокутника: "))
# for i in range(height):
#     for j in range(width):
#         print('*', end='')
#     print()

# Завдання 6
# Створіть програму авторизації, в якій користувачеві дається 3 спроби ввести свої облікові дані (логін та пароль).
# Якщо користувач за меншу кількість спроб ввів вірні дані, програма достроково припиняє своє виконання та виводить на екран повідомлення: «Авторизацію успішно пройдено з «№» спроби».

# login = "user"
# password = "pass"
# attempts = 0

# while attempts < 3:  
#     user_login = input("Введіть логін: ")
#     user_password = input("Введіть пароль: ")
#     if user_login == login and user_password == password:
#         print(f"Авторизацію успішно пройдено з {attempts + 1} спроби.") 
#         break
#     else:
#         print("Невірний логін або пароль. Спробуйте ще раз.")
#     attempts += 1

# if attempts == 3:
#     print("Авторизацію не вдалося пройти.")