# Завдання 1
# Створіть програму, яка зчитує рядок, в якому знаходиться ПІБ користувача і перевіряє, 
# чи складається рядок з літер, при чому кожне слово має бути записане з великої літери. 
# Вивести результат на екран.

# name = input("Введіть ваше ПІБ: ")

# if name.istitle():
#     if name.replace(' ', '').isalpha():
#       print("ПІБ введено коректно.")
# else:
#     print("ПІБ введено некоректно.")    



 
# Завдання 2
# Напишіть програму, в якій користувач вводить із клавіатури діапазон чисел (в діапазоні має бути не менше 5 чисел). 
# Вивести на екран суму другого, передостаннього, а також середнього арифметичного значення даної послідовності. 


# numbers1 = int(input())
# numbers2 = int(input())

# if numbers2 - numbers1 >= 5:
#   numbers = tuple(range(numbers1, numbers2 + 1))
#   avg = sum(numbers) / len(numbers)
#   print(numbers[1] + numbers[-2] + avg)
  

# Завдання 3
# Напишіть програму, яка на вхід отримує параметри кольору (в діапазоні від 0 до 255 для кожного кольору) 
# у форматі RGB і виводить на екран кортеж, у якому зберігається колір.

# r = int(input("Введіть значення червоного кольору (0-255): "))
# g = int(input("Введіть значення зеленого кольору (0-255): "))
# b = int(input("Введіть значення синього кольору (0-255): "))
# color = (r, g, b)
# print("Кортеж кольору:", color)

# Завдання 4
# Ознайомтеся за допомогою документації з класами namedtuple та deque модуля collections. 
# Створіть фабрику іменованих кортежів оцінок для учнів однієї групи з предметів: алгебра, геометрія, історія, інформатика, географія. Вивести дані на екран.

# from collections import namedtuple, deque 
# Student = namedtuple('Student', ['name', 'algebra', 'geometry', 'history', 'informatics', 'geography'])
# students = deque([
#     Student('Dmytro', 90, 85, 88, 92, 80),
#     Student('Anna', 95, 90, 93, 89, 85),
#     Student('Olga', 85, 80, 82, 88, 90),
#     Student('Pavlo', 88, 92, 90, 85, 87)
# ])
# for student in students:
#     print(student)  
    

# Завдання 5
# Напишіть програму, яка вводить з клавіатури послідовність чисел, 
# перетворює послідовність на кортеж і виводить його відсортованим у порядку зростання.    

# numbers = input("Введіть послідовність чисел (через кому): ")
# number_tuple = tuple(sorted(map(int, numbers.split(','))))
# print("Відсортований кортеж:", number_tuple)


# Завдання 6
# Напишіть програму для аналізу фідбеку від відвідувачів курорту «Морська зірка», 
# яка повинна знаходити згадки про меню, спортзал, 
# обслуговування(за кожне знайдене співпадіння нараховується 5% знижки на наступне відвідування). 
# Якщо фідбек перевищив 60 символів, відвідувачу надається додаткова знижка 15% на наступне відвідування.

# feedback = input("Введіть ваш фідбек: ")
# discount = 0

# if "меню" in feedback:
#     discount += 5
# if "спортзал" in feedback:
#     discount += 5
# if "обслуговування" in feedback:
#     discount += 5
# if len(feedback) > 60:
#     discount += 15

# print(f"Ваша знижка на наступне відвідування: {discount}%.")
