# Завдання 1 
# Створіть список та введіть його значення. 
# Знайдіть найбільший та найменший елемент списку, а також суму та середнє арифметичне його значень. 

# numbers = []
# while True:
#     number =  input("Введіть число або '-' для завершення: ")
#     if number == '-':
#       print("Введення чисел завершено.")
#       break
#     else:
#       number = int(number)
#       numbers += (number, )
# print("Створений список:", numbers)  
# print("Найбільший елемент:", max(numbers))  
# print("Найменший елемент:", min(numbers))  

# Завдання 2 
# Є два списки, які наповнюються користувачем з клавіатури. 
# Сформувати список, в якому будуть міститися унікальні значення першого відносно другого списку та навпаки без повторень. 
# Роздрукувати підсумковий об'єкт на екран в прямій послідовності, зворотній, а також виконати сортування за зростанням та спаданням.

num1 = []
num2 = []
while True:
    number1 =  input("Введіть число для першого списку або '-' для завершення: ")
    if number1 == '-':
      print("Введення чисел до першого списку завершено.")
      break
    else:
      number1 = int(number1)
      num1.append(number1)

while True:
    number2 =  input("Введіть число для другого списку або '-' для завершення: ")
    if number2 == '-':
      print("Введення чисел до другого списку завершено.")
      break
    else:
      number2 = int(number2)
      num2.append(number2)
unique_num1 = set(num1) - set(num2)
unique_num2 = set(num2) - set(num1)
result = list(unique_num1.union(unique_num2))
print("Підсумковий список у прямій послідовності:", result)  
print("Підсумковий список у зворотній послідовності:", result[::-1])  
print("Підсумковий список відсортований за зростанням:", sorted(result))  
print("Підсумковий список відсортований за спаданням:", sorted(result, reverse=True))